[
    {
        "id": "project1",
        "titleH1": "Chicken",
        "titleH2": "Capitol",
        "date": "Sept - 2023",
        "client": "Marketing, Branding, Design",
        "image1": "assets/imgs/projects/Chiken Captitol seqeunce_page-0002.jpg",
        "title1": "Building a Beloved Brand in Abuja’s Competitive Food Scene",
        "description1": "Before rebranding efforts, Chicken Capitol was one of many local eateries serving shawarma. While their product—a delicious fusion of traditional Nigerian flavors with international flair—was exceptional, they struggled to stand out in a crowded market. Customers often associated them with “just another shawarma spot,” leaving untapped potential for growth and loyalty.",
        "description2": "The goal was to transform Chicken Capitol into more than just a food vendor—it needed to become a lifestyle brand that resonates emotionally with its audience. The objectives included: Creating a memorable identity tied to quality, flavor, and fun; Increasing foot traffic and online orders by 50% within six months; Building a loyal community around the brand through storytelling and engagement and Positioning Chicken Capitol as the undisputed leader in Abuja's shawarma scene.",
        "image2": "assets/imgs/projects/Chiken Captitol seqeunce_page-0001.jpg",
        "title2": "The campaign launched across multiple channels",
        "description3": [
            {
                "d1": "1. Social Media Campaigns: Platforms like Instagram, Facebook, and TikTok showcased vibrant photos, videos, and reels highlighting the juiciness of the shawarma, the freshness of ingredients, and satisfied customers enjoying their meals.",
                "d2": "2. Influencer Partnerships: Local micro-influencers shared authentic testimonials, creating buzz and encouraging trial among their followers.",
                "d3": "3. Outdoor Advertising: Strategically placed billboards near high-traffic areas in Abuja featured catchy slogans like “The Throne Awaits Your Taste Buds.",
                "d4": "4. Referral Program: Existing customers earned rewards for referring friends, incentivizing word-of-mouth promotion."
            }
        ],
        "image3": "assets/imgs/projects/Chiken Captitol seqeunce_page-0003.jpg",
        "image4": "assets/imgs/projects/Chiken Captitol seqeunce_page-0006.jpg",
        "image5": "assets/imgs/projects/Chiken Captitol seqeunce_page-0005.jpg",
        "image6": "assets/imgs/projects/Chiken Captitol seqeunce_page-0004.jpg",
        "image7": "assets/imgs/projects/Chiken Captitol seqeunce_page-0007.jpg",
        "image8": "assets/imgs/projects/Chiken Captitol seqeunce_page-0008.jpg",
        "image9": "assets/imgs/projects/Chiken Captitol seqeunce_page-0009.jpg",
        "image10": "assets/imgs/projects/Chiken Captitol seqeunce_page-0010.jpg",
        "image11": "assets/imgs/projects/Chiken Captitol seqeunce_page-0012.jpg",
        "image12": "assets/imgs/projects/Chiken Captitol seqeunce_page-0011.jpg",
        "image13": "assets/imgs/projects/Chiken Captitol seqeunce_page-0013.jpg",
        "image14": "assets/imgs/projects/Chiken Captitol seqeunce_page-0014.jpg",
        "image15": "assets/imgs/projects/Chiken Captitol seqeunce_page-0015.jpg",
        "image16": "assets/imgs/projects/Chiken Captitol seqeunce_page-0016.jpg",
        "image17": "assets/imgs/projects/Chiken Captitol seqeunce_page-0017.jpg",
        "image18": "assets/imgs/projects/Chiken Captitol seqeunce_page-0018.jpg"
    },
    {
        "id": "project2",
        "titleH1": "Glims",
        "titleH2": "Wave",
        "date": "Feb - 2020",
        "client": "Website, Application, Design",
        "image1": "assets/imgs/projects/Glim Brand Sequence_pages-to-jpg-0014.jpg",
        "title1": "Revolutionizing Currency Exchange and Travel Services for Africans",
        "description1": "GlimsWave is redefining the traditional street currency exchange system by offering a premium, reliable, and tech-savvy solution tailored to smaller businesses, immigrants, and travelers between Ghana, Nigeria, and other parts of Africa. By combining seamless digital tools with personalized customer service, GlimsWave bridges cultural gaps, empowers cross-border trade, and simplifies travel logistics—all while championing innovation in African financial ecosystems.",
        "description2": "GlimsWave isn’t just another fintech startup—it’s a movement dedicated to empowering Africans to thrive in a connected world. Through its innovative approach to currency exchange and travel services, GlimsWave proves that technology can preserve culture, build trust, and create lasting impact. This case study explores how GlimsWave achieved its mission of transforming informal markets into trusted platforms that celebrate African ingenuity, culture, and connectivity.",
        "image2": "assets/imgs/projects/Glim Brand Sequence_pages-to-jpg-0001.jpg",
        "title2": "Key Impacts of Our Work on the GlimsWave Brand",
        "description3": [
            {
                "d1": "1. Positioned as the Premier Choice in Cross-Border Transactions: Through strategic branding, messaging, and campaigns, we successfully elevated GlimsWave’s perception from a startup to the gold standard for currency exchange and travel services across West Africa. By emphasizing reliability, innovation, and cultural pride, GlimsWave is now recognized as the go-to platform for small business owners, immigrants, and travelers seeking seamless, secure, and tech-driven solutions.",
                "d2": "2. Exponential Growth in Customer Base (1,020+ New Customers): Our targeted marketing efforts—including localized content, social media storytelling, influencer collaborations, and community events—drove significant customer acquisition. With over 1,020 new customers onboarded , GlimsWave has solidified its presence in key markets like Ghana and Nigeria while expanding its reach into other African countries. This growth underscores the effectiveness of our campaigns in resonating with diverse audiences.",
                "d3": "3. Enhanced Trust and Loyalty Through Authentic Messaging: By crafting messages that celebrate African heritage and address real-world challenges faced by users, we built deep emotional connections with GlimsWave’s audience. Campaigns like #AFutureWithoutBorders not only highlighted the brand’s value proposition but also fostered trust and loyalty among customers who see GlimsWave as a partner in their personal and professional journeys.",
                "d4": "4. Increased Market Differentiation and Competitive Edge: The unique blend of modern technology, African-inspired design, and community-centric initiatives set GlimsWave apart from competitors. Our work ensured that every touchpoint—from the app interface to billboard ads—communicated a distinct identity rooted in authenticity, accessibility, and aspiration . As a result, GlimsWave stands out as the most innovative player in an otherwise fragmented market."
            }
        ],
        "image3": "assets/imgs/projects/Glim Brand Sequence_pages-to-jpg-0003.jpg",
        "image4": "assets/imgs/projects/Glim Brand Sequence_pages-to-jpg-0006.jpg",
        "image5": "assets/imgs/projects/Glim Brand Sequence_pages-to-jpg-0005.jpg",
        "image6": "assets/imgs/projects/Glim Brand Sequence_pages-to-jpg-0004.jpg",
        "image7": "assets/imgs/projects/Glim Brand Sequence_pages-to-jpg-0007.jpg",
        "image8": "assets/imgs/projects/Glim Brand Sequence_pages-to-jpg-0008.jpg",
        "image9": "assets/imgs/projects/Glim Brand Sequence_pages-to-jpg-0009.jpg",
        "image10" : "assets/imgs/projects/Glim Brand Sequence_pages-to-jpg-0018.jpg",
        "image11" : "assets/imgs/projects/Glim Brand Sequence_pages-to-jpg-0012.jpg",
        "image12" : "assets/imgs/projects/Glim Brand Sequence_pages-to-jpg-0011.jpg",
        "image13" : "assets/imgs/projects/Glim Brand Sequence_pages-to-jpg-0013.jpg",
        "image14" : "assets/imgs/projects/Glim Brand Sequence_pages-to-jpg-0015.jpg",
        "image15" : "assets/imgs/projects/Glim Brand Sequence_pages-to-jpg-0014.jpg",
        "image16": "assets/imgs/projects/Glim Brand Sequence_pages-to-jpg-0016.jpg",
        "image17": "assets/imgs/projects/Glim Brand Sequence_pages-to-jpg-0017.jpg",
        "image18": "assets/imgs/projects/Glim Brand Sequence_pages-to-jpg-0010.jpg"
    }
]